




// let arr = [NaN, 0, 77, false, -17, '', undefined, 99, null ]
// arr = arr.map((el) => {
//         console.log(el)
// })


// console.log(arr.filter((el) => {
//  if (el !== false && el !== NaN && el !== "" && el !== undefined && el !== null) {
//   return el
//  }
// }))


// let arr = [3, 51, -30,81, -54, 60]
// arr = arr.map((el,index,array) => {
//         console.log(index, el)
//     }
// )



// let arr = ['Бегимай', 'Баяман', 'Калмамат']
// let res = []
// res = arr.map((el,index,array) => {
//         return el
// })
// console.log(res)


//////  FILTER - УСЛОВИЯДАН откон el жаны массив менен кайтарып берет


////////    map - бизге жаны массивти кайтарып берет


// let arr = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
// let arr2 = []
// arr2 = arr.map((el ) => el % 2 === 0)

// arr2 = arr.map((el) => {
//     if (el % 2 === 0) {
//         return el
//     }
// })
// console.log(arr)
// console.log(arr2)
//
//
//

//  arr2 = arr.map((el, index,array) => {
//     return el
// })
// console.log(arr)
// console.log(arr2)



///////////////////////////////////////    sort()        ///////////

// let arr = [2,4,13,66,9,5,]
// console.log(arr.sort((a,b) => a - b ))
//


// let arr = [ 15,1,2,3,4,5,6,7,8,9,10,11,12,13,14,]
// console.log(arr.sort((a,b) => a - b))             //   //  Бабал алгаритим

// let arr = [123, 23, 76, 90,-12,10,]
// console.log(arr.sort((a,b) => a - b))
//

// console.log('a' > 'b')
// console.log('a'.charCodeAt(0))
// console.log('b'.charCodeAt(0))



// let arr = [1,2,3,4,5,]
// console.log(arr.map((el, index) =>{
//     if (index % 2 !== 0){
//         return el + 2
//     } else {
//         return  el
//     }
// }))

// let res = [ 22,25,76,80, 91]
// console.log(res.map((el,index) => {
//     if (el % 2 === 0){
//         return el + 2
//     }else {
//         return el
//     }
// }))


/////////////////////   TASK   ///////////////////////////////////////////

//
// let arr = [315,64,75,43,65,63]
// console.log(arr.map(el => el + el))
//

//

// let arr = ['Бегимай', 'Баяман', 'Калмамат']
// console.log(arr.map(el => el.length))
// //
// //
// let arr = [4, 54, 49]
// console.log(arr.map(el => el ** 2))
// console.log(arr.map(el => Math.pow(el,2)))



// let res = ['azatbek', 'maratbek','alibek', 'bill', 'web']
// console.log(res.map(el => el.length))



////////////////////////// TASK - 31.0523  ////////////////////////////



// 1. Вам дан массив: [315, 64, 75, 43, 65, 63].Найдите сумму каждого числа.

// let arr = [315, 64, 75, 43, 65, 63]


// 2. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат'].
// Создайте функцию, изменяющую букву а в каждом имени на я и выведите в консоль.

// let arr = ['Аскар', 'Баяман', 'Калмамат']



// 3. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат'].
// Создайте функцию, которая выводит только те имена, где есть буква к и выведите в консоль.

// 4. Вам дан массив: [4, 54, 49]. Сделайте из него массив,
// состоящий из квадратов этих чисел.

// 5. Вам дан массив [3134, 4, -143, -245, -214].
// Оставьте в нем только отрицательные числа.

// 6. Вам дан массив [3, 51, 30, 54, 60]. Оставьте
// в нем только четные числа.

// 7. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат'].
// Оставьте в нем только те строки, длина которых больше 5-ти символов.

// 8. Вам дан массив [-13, 96, -41, -28, 40].
// Посчитайте количество отрицательных чисел в этом массиве.

// const task8 = (arr) => {
//     return arr.filter(el => {
//         return el < 0
//     })
// }
// console.log(task8([-13, 96, -41, -28, 40]))

// 9. Вам дан массив [3, 51, -30, -54, 60].
// Оставьте в нем только положительные числа. Затем
// извлеките квадратный корень из этих чисел, если эти числа больше 30.
//
// const task9 = (arr) => {
//     return arr.filter( el => {
//         return  el > 0
//     })
// }
// console.log(task9([3, 51, -30, -54, 60]))

// 10. Вам дан массив [55, 44, 55, 44, 15, 49].
// Оставьте в нем только неповторяющиеся числа.

// 11. Вам дан массив [NaN, 0, 77, false, -17, '',undefined, 99, null].
// Создайте функцию, которая очищает массив от ложных (false) значений:
// false, null, undefined, 0, –0, NaN и "" (пустая строка).

// 12. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Выведите длину каждой строки.